hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_sysctl_regs.h
/*
 * HALT (RW)
 *
 * halt request for CPU0,
 * 0: CPU0 will start to execute after reset or receive wakeup request
 * 1: CPU0 will not start after reset, or wakeup after WFI
 */
#define SYSCTL_CPU_LP_HALT_MASK (0x10000UL)
#define SYSCTL_CPU_LP_HALT_SHIFT (16U)
#define SYSCTL_CPU_LP_HALT_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_HALT_SHIFT) & SYSCTL_CPU_LP_HALT_MASK)
#define SYSCTL_CPU_LP_HALT_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_HALT_MASK) >> SYSCTL_CPU_LP_HALT_SHIFT)

/*
 * WAKE (RO)
 *
 * CPU0 is waking up
 * 0: CPU0 wake up not asserted
 * 1: CPU0 wake up asserted
 */
#define SYSCTL_CPU_LP_WAKE_MASK (0x2000U)
#define SYSCTL_CPU_LP_WAKE_SHIFT (13U)
#define SYSCTL_CPU_LP_WAKE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_WAKE_MASK) >> SYSCTL_CPU_LP_WAKE_SHIFT)

/*
 * EXEC (RO)
 *
 * CPU0 is executing
 * 0: CPU0 is not executing
 * 1: CPU0 is executing
 */
#define SYSCTL_CPU_LP_EXEC_MASK (0x1000U)
#define SYSCTL_CPU_LP_EXEC_SHIFT (12U)
#define SYSCTL_CPU_LP_EXEC_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_EXEC_MASK) >> SYSCTL_CPU_LP_EXEC_SHIFT)

/*
 * WAKE_FLAG (RW)
 *
 * CPU0 wakeup flag, indicate a wakeup event got active, write 1 to clear this bit
 * 0: CPU0 wakeup not happened
 * 1: CPU0 wake up happened
 */
#define SYSCTL_CPU_LP_WAKE_FLAG_MASK (0x400U)
#define SYSCTL_CPU_LP_WAKE_FLAG_SHIFT (10U)
#define SYSCTL_CPU_LP_WAKE_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_WAKE_FLAG_SHIFT) & SYSCTL_CPU_LP_WAKE_FLAG_MASK)
#define SYSCTL_CPU_LP_WAKE_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_WAKE_FLAG_MASK) >> SYSCTL_CPU_LP_WAKE_FLAG_SHIFT)

/*
 * SLEEP_FLAG (RW)
 *
 * CPU0 sleep flag, indicate a sleep event got active, write 1 to clear this bit
 * 0: CPU0 sleep not happened
 * 1: CPU0 sleep happened
 */
#define SYSCTL_CPU_LP_SLEEP_FLAG_MASK (0x200U)
#define SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT (9U)
#define SYSCTL_CPU_LP_SLEEP_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT) & SYSCTL_CPU_LP_SLEEP_FLAG_MASK)
#define SYSCTL_CPU_LP_SLEEP_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_SLEEP_FLAG_MASK) >> SYSCTL_CPU_LP_SLEEP_FLAG_SHIFT)

/*
 * RESET_FLAG (RW)
 *
 * CPU0 reset flag, indicate a reset event got active, write 1 to clear this bit
 * 0: CPU0 reset not happened
 * 1: CPU0 reset happened
 */
#define SYSCTL_CPU_LP_RESET_FLAG_MASK (0x100U)
#define SYSCTL_CPU_LP_RESET_FLAG_SHIFT (8U)
#define SYSCTL_CPU_LP_RESET_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_RESET_FLAG_SHIFT) & SYSCTL_CPU_LP_RESET_FLAG_MASK)
#define SYSCTL_CPU_LP_RESET_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_RESET_FLAG_MASK) >> SYSCTL_CPU_LP_RESET_FLAG_SHIFT)

/*
 * MODE (RW)
 *
 * Low power mode, system behavior after WFI
 * 00: CPU clock stop after WFI
 * 01: System enter low power mode after WFI
 * 10: Keep running after WFI
 * 11: reserved
 */
#define SYSCTL_CPU_LP_MODE_MASK (0x3U)
#define SYSCTL_CPU_LP_MODE_SHIFT (0U)
#define SYSCTL_CPU_LP_MODE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_MODE_SHIFT) & SYSCTL_CPU_LP_MODE_MASK)
#define SYSCTL_CPU_LP_MODE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_MODE_MASK) >> SYSCTL_CPU_LP_MODE_SHIFT)

/* Bitfield definition for register of struct array CPU: LOCK */
/*
 * GPR (RW)
 *
 * Lock bit for CPU_DATA0 to CPU_DATA13, once set, this bit will not clear untile next reset
 */
#define SYSCTL_CPU_LOCK_GPR_MASK (0xFFFCU)
#define SYSCTL_CPU_LOCK_GPR_SHIFT (2U)
#define SYSCTL_CPU_LOCK_GPR_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_GPR_SHIFT) & SYSCTL_CPU_LOCK_GPR_MASK)
#define SYSCTL_CPU_LOCK_GPR_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_GPR_MASK) >> SYSCTL_CPU_LOCK_GPR_SHIFT)

/*
 * LOCK (RW)
 *
 * Lock bit for CPU_LOCK
 */
#define SYSCTL_CPU_LOCK_LOCK_MASK (0x2U)
#define SYSCTL_CPU_LOCK_LOCK_SHIFT (1U)
#define SYSCTL_CPU_LOCK_LOCK_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_LOCK_SHIFT) & SYSCTL_CPU_LOCK_LOCK_MASK)
#define SYSCTL_CPU_LOCK_LOCK_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_LOCK_MASK) >> SYSCTL_CPU_LOCK_LOCK_SHIFT)

/* Bitfield definition for register of struct array CPU: GPR0 */
/*
 * GPR (RW)
 *
 * register for software to handle resume, can save resume address or status
 */
#define SYSCTL_CPU_GPR_GPR_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_GPR_GPR_SHIFT (0U)
#define SYSCTL_CPU_GPR_GPR_SET(x) (((uint32_t)(x) << SYSCTL_CPU_GPR_GPR_SHIFT) & SYSCTL_CPU_GPR_GPR_MASK)
#define SYSCTL_CPU_GPR_GPR_GET(x) (((uint32_t)(x) & SYSCTL_CPU_GPR_GPR_MASK) >> SYSCTL_CPU_GPR_GPR_SHIFT)

/* Bitfield definition for register of struct array CPU: STATUS0 */
/*
 * STATUS (RO)
 *
 * IRQ values
 */
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK) >> SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT)

/* Bitfield definition for register of struct array CPU: ENABLE0 */
/*
 * ENABLE (RW)
 *
 * IRQ wakeup enable
 */
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK) >> SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT)



/* RESOURCE register group index macro definition */
#define SYSCTL_RESOURCE_CPU0 (0UL)
#define SYSCTL_RESOURCE_CPX0 (1UL)
#define SYSCTL_RESOURCE_PMIC (20UL)
#define SYSCTL_RESOURCE_POW_CPU0 (21UL)
#define SYSCTL_RESOURCE_RST_SOC (23UL)
#define SYSCTL_RESOURCE_RST_CPU0 (24UL)
#define SYSCTL_RESOURCE_CLK_SRC_XTAL (32UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0 (33UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL0 (34UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL0 (35UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1 (36UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL1 (37UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL1 (38UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK2_PLL1 (39UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2 (40UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL2 (41UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL2 (42UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0_REF (43UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1_REF (44UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL2_REF (45UL)
#define SYSCTL_RESOURCE_CLK_TOP_CPU0 (64UL)
#define SYSCTL_RESOURCE_CLK_TOP_MCT0 (65UL)
#define SYSCTL_RESOURCE_CLK_TOP_AHB0 (66UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIF (67UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIS (68UL)
#define SYSCTL_RESOURCE_CLK_TOP_AXIC (69UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR0 (70UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR1 (71UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR2 (72UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR3 (73UL)
#define SYSCTL_RESOURCE_CLK_TOP_OWR0 (74UL)
#define SYSCTL_RESOURCE_CLK_TOP_OWR1 (75UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C0 (76UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C1 (77UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C2 (78UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C3 (79UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI0 (80UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI1 (81UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI2 (82UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI3 (83UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT0 (84UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT1 (85UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT2 (86UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT3 (87UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT4 (88UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT5 (89UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT6 (90UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT7 (91UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN0 (92UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN1 (93UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN2 (94UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN3 (95UL)
#define SYSCTL_RESOURCE_CLK_TOP_XPI0 (96UL)
#define SYSCTL_RESOURCE_CLK_TOP_ESC0 (97UL)
#define SYSCTL_RESOURCE_CLK_TOP_ETH0 (98UL)
#define SYSCTL_RESOURCE_CLK_TOP_PTP0 (99UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF0 (100UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF1 (101UL)
#define SYSCTL_RESOURCE_CLK_TOP_NTM0 (102UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA0 (103UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA1 (104UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC0 (105UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC1 (106UL)
#define SYSCTL_RESOURCE_AHBP (256UL)
#define SYSCTL_RESOURCE_AXIS (257UL)
#define SYSCTL_RESOURCE_AXIC (258UL)
#define SYSCTL_RESOURCE_ROM0 (259UL)
#define SYSCTL_RESOURCE_LMM0 (260UL)
#define SYSCTL_RESOURCE_MCT0 (261UL)
#define SYSCTL_RESOURCE_TMR0 (262UL)
#define SYSCTL_RESOURCE_TMR1 (263UL)
#define SYSCTL_RESOURCE_TMR2 (264UL)
#define SYSCTL_RESOURCE_TMR3 (265UL)
#define SYSCTL_RESOURCE_OWR0 (266UL)
#define SYSCTL_RESOURCE_OWR1 (267UL)
#define SYSCTL_RESOURCE_EUI0 (268UL)
#define SYSCTL_RESOURCE_EUI1 (269UL)
#define SYSCTL_RESOURCE_I2C0 (270UL)
#define SYSCTL_RESOURCE_I2C1 (271UL)
#define SYSCTL_RESOURCE_I2C2 (272UL)
#define SYSCTL_RESOURCE_I2C3 (273UL)
#define SYSCTL_RESOURCE_SPI0 (274UL)
#define SYSCTL_RESOURCE_SPI1 (275UL)
#define SYSCTL_RESOURCE_SPI2 (276UL)
#define SYSCTL_RESOURCE_SPI3 (277UL)
#define SYSCTL_RESOURCE_URT0 (278UL)
#define SYSCTL_RESOURCE_URT1 (279UL)
#define SYSCTL_RESOURCE_URT2 (280UL)
#define SYSCTL_RESOURCE_URT3 (281UL)
#define SYSCTL_RESOURCE_URT4 (282UL)
#define SYSCTL_RESOURCE_URT5 (283UL)
#define SYSCTL_RESOURCE_URT6 (284UL)
#define SYSCTL_RESOURCE_URT7 (285UL)
#define SYSCTL_RESOURCE_CRC0 (286UL)
#define SYSCTL_RESOURCE_TSNS (287UL)
#define SYSCTL_RESOURCE_WDG0 (288UL)
#define SYSCTL_RESOURCE_WDG1 (289UL)
#define SYSCTL_RESOURCE_MBX0 (290UL)
#define SYSCTL_RESOURCE_GPIO (291UL)
#define SYSCTL_RESOURCE_PPI0 (292UL)
#define SYSCTL_RESOURCE_HDMA (293UL)
#define SYSCTL_RESOURCE_LOBS (294UL)
#define SYSCTL_RESOURCE_ADC0 (295UL)
#define SYSCTL_RESOURCE_ADC1 (296UL)
#define SYSCTL_RESOURCE_CMP0 (297UL)
#define SYSCTL_RESOURCE_CAN0 (298UL)
#define SYSCTL_RESOURCE_CAN1 (299UL)
#define SYSCTL_RESOURCE_CAN2 (300UL)
#define SYSCTL_RESOURCE_CAN3 (301UL)
#define SYSCTL_RESOURCE_PTPC (302UL)
#define SYSCTL_RESOURCE_QEI0 (303UL)
#define SYSCTL_RESOURCE_QEI1 (304UL)
#define SYSCTL_RESOURCE_QEO0 (305UL)
#define SYSCTL_RESOURCE_QEO1 (306UL)
#define SYSCTL_RESOURCE_SDM0 (307UL)
#define SYSCTL_RESOURCE_PLB0 (308UL)
#define SYSCTL_RESOURCE_PWM0 (309UL)
#define SYSCTL_RESOURCE_PWM1 (310UL)
#define SYSCTL_RESOURCE_EMDS (311UL)
#define SYSCTL_RESOURCE_XPI0 (312UL)
#define SYSCTL_RESOURCE_RAM0 (313UL)
#define SYSCTL_RESOURCE_XDMA (314UL)
#define SYSCTL_RESOURCE_ESC0 (315UL)
#define SYSCTL_RESOURCE_ETH0 (316UL)
#define SYSCTL_RESOURCE_USB0 (317UL)
#define SYSCTL_RESOURCE_NTM0 (318UL)
#define SYSCTL_RESOURCE_REF0 (319UL)
#define SYSCTL_RESOURCE_REF1 (320UL)

/* GROUP0 register group index macro definition */
#define SYSCTL_GROUP0_LINK0 (0UL)
#define SYSCTL_GROUP0_LINK1 (1UL)
#define SYSCTL_GROUP0_LINK2 (2UL)
#define SYSCTL_GROUP0_LINK3 (3UL)

/* GROUP1 register group index macro definition */
#define SYSCTL_GROUP1_LINK0 (0UL)
#define SYSCTL_GROUP1_LINK1 (1UL)
#define SYSCTL_GROUP1_LINK2 (2UL)
#define SYSCTL_GROUP1_LINK3 (3UL)

/* AFFILIATE register group index macro definition */
#define SYSCTL_AFFILIATE_CPU0 (0UL)

